music/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id") VALUES (?, ?, ?)  [["title", "Smells Like Teen Spirit"], ["year", 0], ["band_id", 1]]
---
    def create
        @album = Album.new(album_params)
        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @album = Album.find(params[:id])