music/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Nirvana"], ["created_at", "2019-05-02 18:44:11.882884"], ["updated_at", "2019-05-02 18:44:11.882884"]]
---
    def create
        @band = Band.new(band_params)
        if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["name", "Nirvana BABY"], ["updated_at", "2019-05-02 19:25:26.462930"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])
        if @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @band = Band.find(params[:id])