music/app/views/albums/new.html.erb

    <select name="album[band_id]" id="album_studio_type">
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"


    <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"